Revit 2022 API
AnalyticalModel.CanHaveRigidLinks Method
 Indicates if Analytical Model supports Rigid Links.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public bool CanHaveRigidLinks()
Visual Basic
Public Function CanHaveRigidLinks As Boolean
Visual C++
public:
bool CanHaveRigidLinks()
Return Value
 True if Analytical Model supports Rigid Links; false otherwise.
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace